Revit 2024 API
AlignmentStationLabel.IsValid Method (Element)
 Checks if the element is a valid alignment station label.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public static bool IsValid(
	Element element
)
Visual Basic
Public Shared Function IsValid ( _
	element As Element _
) As Boolean
Visual C++
public:
static bool IsValid(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
The element to validate.
See Also
AlignmentStationLabel Class
IsValid Overload
Autodesk.Revit.DB.Infrastructure Namespace